balance/src/Catalogs/СтатьиДвижения/СтатьиДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвижения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные cредства</description>
    </items>
    <items>
      <name>Прибыль</name>
      <description>Прибыль</description>
    </items>
  </predefined>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Внутренний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Внутренний</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделДДС</name>
    <type>
      <types>EnumRef.РазделыДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделОПиУДоход</name>
    <type>
      <types>CatalogRef.РазделыОПиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделОПиУРасход</name>
    <type>
      <types>CatalogRef.РазделыОПиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБаланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйПуть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

balance/src/Enums/РазделыДДС/РазделыДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыДДС</name>
  <enumValues>
    <name>ОперационнаяДеятельность</name>
  </enumValues>
  <enumValues>
    <name>ИнвестиционнаяДеятельность</name>
  </enumValues>
  <enumValues>
    <name>ФинансоваяДеятельность</name>
  </enumValues>
</mdclass:Enum>

balance/src/Catalogs/РазделыОПиУ/РазделыОПиУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыОПиУ</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОбщиеПродажи</name>
      <description>1. Общие продажи</description>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>2. Себестоимость</description>
    </items>
    <items>
      <name>АдминистративныеРасходы</name>
      <description>3. Административные расходы</description>
    </items>
    <items>
      <name>КоммерческиеМаркетинговыеРасходы</name>
      <description>4. Комм/маркет расходы</description>
    </items>
    <items>
      <name>Налоги</name>
      <description>5. Налоги</description>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходыВнереализационные</name>
      <description>6. Прочие Доходы и Расходы (Внереализационные)</description>
    </items>
  </predefined>
</mdclass:Catalog>

balance/src/ChartsOfAccounts/Внутренний/Внутренний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Внутренний</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
      <code>ВНЕОБОРОТНЫЕАКТИВЫ</code>
      <childItems>
        <name>ОсновныеСредства</name>
        <description>Основные средства</description>
        <code>ОСНОВНЫЕСРЕДСТВА</code>
      </childItems>
      <childItems>
        <name>НематериальныеАктивы</name>
        <description>Нематериальные активы</description>
        <code>НЕМАТЕРИАЛЬНЫЕАКТИВЫ</code>
      </childItems>
    </items>
    <items>
      <name>ОборотныеАктивы</name>
      <description>ОборотныеАктивы</description>
      <code>ОБОРОТНЫЕАКТИВЫ</code>
      <childItems>
        <name>Запасы</name>
        <description>Запасы</description>
        <code>ЗАПАСЫ</code>
      </childItems>
      <childItems>
        <name>ДенежныеСредства</name>
        <description>Денежные средства</description>
        <code>ДЕНЕЖНЫЕСРЕДСТВА</code>
      </childItems>
      <childItems>
        <name>ДебиторскаяЗадолженность</name>
        <description>Дебиторская задолженность</description>
        <code>ДЕБИТОРСКАЯ ЗАДОЛЖЕННОСТЬ</code>
        <childItems>
          <name>ЗадолженностьПокупателей</name>
          <description>Задолженность покупателей</description>
          <code>Задолженность покупателей</code>
        </childItems>
        <childItems>
          <name>АвансыВыданныеПоставщикам</name>
          <description>Авансы выданные поставщикам</description>
          <code>Авансы выданные поставщикам</code>
        </childItems>
        <childItems>
          <name>АвансыВыданныеСотрудникам</name>
          <description>Авансы выданные сотрудникам</description>
          <code>Авансы выданные сотрудникам</code>
        </childItems>
      </childItems>
      <childItems>
        <name>ПрочиеАктивы</name>
        <description>Прочие активы</description>
        <code>ПРОЧИЕАКТИВЫ</code>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Операции с капиталом</description>
      <code>КАПИТАЛ</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НакопительнаяПрибыльУбыток</name>
      <description>Накопительная прибыль/убыток</description>
      <code>НАКОПИТЕЛЬНАЯПРИБЫЛЬУБЫТОК</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ВзаиморасчетыИнвестор</name>
      <description>Взаиморасчеты с инвестором</description>
      <code>ВЗАИМОРАСЧЕТЫИНВЕСТОР</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>ОБЯЗАТЕЛЬСТВА</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>ДолгосрочныеОбязательства</name>
        <description>Долгосрочные обязательства</description>
        <code>ДОЛГОСРОЧНЫЕОБЯЗАТЕЛЬСТВА</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>КраткосрочныеОбязательства</name>
        <description>Краткосрочные обязательства</description>
        <code>КРАТКОСРОЧНЫЕОБЯЗАТЕЛЬСТВА</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>КредиторскаяЗадолженность</name>
        <description>Кредиторская задолженность</description>
        <code>КРЕДИТОРСКАЯ ЗАДОЛЖЕННОСТЬ</code>
        <accountType>Passive</accountType>
        <childItems>
          <name>АвансыПолученныеОтПокупателей</name>
          <description>Авансы полученные от покупателей</description>
          <code>Авансы полученные от покупателей</code>
          <accountType>Passive</accountType>
        </childItems>
        <childItems>
          <name>ЗадолженностьПоставщикам</name>
          <description>Задолженность поставщикам</description>
          <code>Задолженность поставщикам</code>
          <accountType>Passive</accountType>
        </childItems>
        <childItems>
          <name>ЗадолженностьСотрудникам</name>
          <description>Задолженность сотрудникам</description>
          <code>Задолженность сотрудникам</code>
          <accountType>Passive</accountType>
        </childItems>
      </childItems>
    </items>
  </predefined>
  <attributes>
    <name>ПредставлениеВОстатках</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <comment>Используется ТОЛЬКО для универсального отчета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

balance/src/Catalogs/СтатьиДвижения/Forms/ШаблоныГрупп/Module.bsl
&НаСервере
Процедура ДобавитьГруппыНаСервере()
	Для каждого Стр из  ШаблоныГрупп цикл
		Если Стр.Выбор тогда
			Если Стр.Наименование = "Покупатели" тогда
				СоздатьГруппу("Покупатели", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,Справочники.РазделыОПиУ.ОбщиеПродажи,,ПланыСчетов.Внутренний.ЗадолженностьПокупателей,ПланыСчетов.Внутренний.АвансыПолученныеОтПокупателей);
			ИначеЕсли Стр.Наименование = "Поставщики" тогда
				СоздатьГруппу("Поставщики", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,,ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Сотрудники" тогда
				СоздатьГруппу("Сотрудники", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,,ПланыСчетов.Внутренний.АвансыВыданныеСотрудникам,ПланыСчетов.Внутренний.ЗадолженностьСотрудникам);
			ИначеЕсли Стр.Наименование = "Склады" тогда
				СоздатьГруппу("Склады", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.Себестоимость,ПланыСчетов.Внутренний.Запасы);
			ИначеЕсли Стр.Наименование = "Административные расходы" тогда
				СоздатьГруппу("Административные расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.АдминистративныеРасходы, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Коммерческие расходы" тогда
				СоздатьГруппу("Коммерческие расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.КоммерческиеМаркетинговыеРасходы, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Прочие доходы и расходы" тогда
				СоздатьГруппу("Прочие доходы и расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.ПрочиеДоходыИРасходыВнереализационные, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Налоги" тогда
				СоздатьГруппу("Налоги", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.Налоги, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппу(Название, Подразделение = неопределено, РазделДДС= неопределено, РазделОПиУДоход= неопределено, РазделОПиУРасход= неопределено, СчетУчетаДт= неопределено, СчетУчетаКт= неопределено)
	НоваяГруппа = Справочники.СтатьиДвижения.СоздатьГруппу();
	НоваяГруппа.Наименование = Название;
	НоваяГруппа.Подразделение = Подразделение;
	НоваяГруппа.РазделДДС = РазделДДС;
	НоваяГруппа.СчетУчетаКт = СчетУчетаКт;
	НоваяГруппа.СчетУчетаДт = СчетУчетаДт;
	НоваяГруппа.РазделОПиУДоход = РазделОПиУДоход;
	НоваяГруппа.РазделОПиУРасход = РазделОПиУРасход;
	НоваяГруппа.Валюта = Константы.ОсновнаяВалюта.Получить();
	НоваяГруппа.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппы(Команда)
	Если ПроверитьЗаполнение() тогда 
		ДобавитьГруппыНаСервере();
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполняем список значений шаблонов
	СписокЗн = новый СписокЗначений;
	СписокЗн.Добавить("Покупатели");
	СписокЗн.Добавить("Поставщики");
	СписокЗн.Добавить("Сотрудники");
	СписокЗн.Добавить("Склады");
	СписокЗн.Добавить("Административные расходы");
	СписокЗн.Добавить("Коммерческие расходы");
	СписокЗн.Добавить("Прочие доходы и расходы");
	СписокЗн.Добавить("Налоги");
	
	Для каждого Выбр из СписокЗн цикл
		Стр = ШаблоныГрупп.Добавить();
		Стр.Выбор = ложь;
		Стр.Наименование = Выбр.Значение;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указано Подразделение, для которого будут создаваться группы!";
		Сообщение.Поле = "Подразделение";
		Сообщение.Сообщить();
		
		// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Покупатель"
		
		//ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Подразделение"));
		// Так как информация не консистентна, то продолжать работу дальше смысла нет
		
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры
